# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

import datetime
import locale
loc=locale.getlocale()
locale.setlocale(locale.LC_ALL, ('RU','UTF8'))

days = [
"undefined",
"первое",
"второе",
"третье",
"четвертое",
"пятое",
"шестое",
"седьмое",
"восьмое",
"девятое",
"десятое",
"одиннадцатое",
"двенадцатое",
"тринадцатое",
"четырнадцатое",
"пятнадцатое",
"шестнадцатое",
"и т.п."
]

today = "02.11.2013"
b = today.split('.')
day = int(b[0])
month = int(b[1])
year = b[2]

print(days[day], datetime.date(1900, month, 1).strftime('%B'), year, "года")
